In [1]:
import numpy as np
import pandas as pd

In [17]:
stddata={
    'math':[23,45,67,89,56],
    'physics':[13,88,95,34,77],
    'chemistry':[45,34,55,78,67],
    'computer':[34,60,50,70,80]
    
}
std=['nasir','mansoor','shakeeb','shahzaib','shoaib']
stdframe=pd.DataFrame(stddata,index=std)
stdframe

          math  physics  chemistry  computer
nasir       23       13         45        34
mansoor     45       88         34        60
shakeeb     67       95         55        50
shahzaib    89       34         78        70
shoaib      56       77         67        80

In [52]:
stdframe['total']=stdframe['math']+stdframe['physics']+stdframe['chemistry']

In [53]:
stdframe

          math  physics  chemistry  computer  total
nasir       23       13         45        34     81
mansoor     45       88         34        60    167
shakeeb     67       95         55        50    217
shahzaib    89       34         78        70    201
shoaib      56       77         67        80    200

In [28]:
#stdframe['remarks1']=range(5)
stdframe['remarks1']=["fail"if num<200 else"pass"for num in stdframe['total']]
stdframe
#multiple value list sa dala gi

,math,physics,chemistry,total,per,remarks,remarks1
nasir,23,13,45,81,27.0%,fail,fail
mansoor,45,88,34,167,55.666666666666664%,pass,fail
shakeeb,67,95,55,217,72.33333333333334%,pass,pass
shahzaib,89,34,78,201,67.0%,pass,pass
shoaib,56,77,67,200,66.66666666666666%,pass,pass

In [12]:
stdframe['per']=stdframe['total']/300*100
stdframe['per']=[str(i)+"%"for i in stdframe['per']]
#float ko per ma karna ka liya str function use karna ha

In [33]:
stdframe

,math,physics,chemistry,total,per,remarks,remarks1
nasir,23,13,45,81,27.0%,fail,fail
mansoor,45,88,34,167,55.666666666666664%,pass,fail
shakeeb,67,95,55,217,72.33333333333334%,pass,pass
shahzaib,89,34,78,201,67.0%,pass,pass
shoaib,56,77,67,200,66.66666666666666%,pass,pass

In [34]:
zip1=   zip(stdframe['math'],stdframe['physics'],stdframe['chemistry'])
for i in zip1:
    print(i)

(23, 13, 45)
(45, 88, 34)
(67, 95, 55)
(89, 34, 78)
(56, 77, 67)

In [35]:
stdframe['remarks']=["pass" if (m>=33 and p>=33 and c>=33) else "fail" for m,p,c in zip1]

ValueError: Length of values does not match length of index

In [23]:
#stdframe['remarks']=["pass" if (m>=33 and p>=33 and c>=33) else "fail"
                     #for m,p,c in zip(stdframe['math'],stdframe['physics'],stdframe['chemistry'])]

In [36]:
stdframe
#for loop ak data structure pa chala ga lakin zip sa humna ak sa zaada list provide kardi

,math,physics,chemistry,total,per,remarks,remarks1
nasir,23,13,45,81,27.0%,fail,fail
mansoor,45,88,34,167,55.666666666666664%,pass,fail
shakeeb,67,95,55,217,72.33333333333334%,pass,pass
shahzaib,89,34,78,201,67.0%,pass,pass
shoaib,56,77,67,200,66.66666666666666%,pass,pass

In [37]:
stdframe.T #row to column

,nasir,mansoor,shakeeb,shahzaib,shoaib
math,23,45,67,89,56
physics,13,88,95,34,77
chemistry,45,34,55,78,67
total,81,167,217,201,200
per,27.0%,55.666666666666664%,72.33333333333334%,67.0%,66.66666666666666%
remarks,fail,pass,pass,pass,pass
remarks1,fail,fail,pass,pass,pass

In [41]:
stdframe

          math  physics  chemistry  total                  per remarks
nasir       23       13         45     81                27.0%    fail
mansoor     45       88         34    167  55.666666666666664%    pass
shakeeb     67       95         55    217   72.33333333333334%    pass
shahzaib    89       34         78    201                67.0%    pass
shoaib      56       77         67    200   66.66666666666666%    pass

In [40]:
del stdframe['remarks1']

In [43]:
print(stdframe.columns)
print(stdframe.index)

Index(['math', 'physics', 'chemistry', 'total', 'per', 'remarks'], dtype='object')
Index(['nasir', 'mansoor', 'shakeeb', 'shahzaib', 'shoaib'], dtype='object')

In [44]:
stdframe.index.name="student data"

In [45]:
stdframe.index

Index(['nasir', 'mansoor', 'shakeeb', 'shahzaib', 'shoaib'], dtype='object', name='student data')

In [46]:
stdframe

              math  physics  chemistry  total                  per remarks
student data
nasir           23       13         45     81                27.0%    fail
mansoor         45       88         34    167  55.666666666666664%    pass
shakeeb         67       95         55    217   72.33333333333334%    pass
shahzaib        89       34         78    201                67.0%    pass
shoaib          56       77         67    200   66.66666666666666%    pass

In [54]:
stdframe['computer']

nasir       34
mansoor     60
shakeeb     50
shahzaib    70
shoaib      80
Name: computer, dtype: int64

In [57]:
stdframe.computer

#column ka name ma space aye ga tu call nhi hoga phr huma frame sa call karna hoga

nasir       34
mansoor     60
shakeeb     50
shahzaib    70
shoaib      80
Name: computer, dtype: int64

In [59]:
for i in stdframe.columns:
    if 'computer' in i:
        print('true')
    else:
        print('false')

false
false
false
true
false

In [74]:
stdframe

          math  physics  chemistry  computer  total
nasir       23       13         45        34     81
mansoor     45       88         34        60    167
shakeeb     67       95         55        50    217
shahzaib    89       34         78        70    201
shoaib      56       77         67        80    200

In [63]:
'computer' in stdframe.columns

True

In [64]:
'computers' in stdframe.columns

False

In [66]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])

obj3

0      blue
2    purple
4    yellow
dtype: object

In [67]:
obj3.reindex(range(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [71]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 5, 16])
obj3

0       blue
5     purple
16    yellow
dtype: object

In [73]:
obj3.reindex(range(16), method='ffill')

0       blue
1       blue
2       blue
3       blue
4       blue
5     purple
6     purple
7     purple
8     purple
9     purple
10    purple
11    purple
12    purple
13    purple
14    purple
15    purple
dtype: object

In [78]:
frame = pd.DataFrame(np.arange(12).reshape((3, 4)),
  index=['a', 'c', 'd'],
  columns=['Ohio', 'Texas', 'California','abc'])

In [79]:
frame

   Ohio  Texas  California  abc
a     0      1           2    3
c     4      5           6    7
d     8      9          10   11

In [82]:
frame = pd.DataFrame(np.arange(100).reshape((20, 5)),

  columns=['Ohio', 'Texas', 'California','abc','abc'])

In [83]:
frame

    Ohio  Texas  California  abc  abc
0      0      1           2    3    4
1      5      6           7    8    9
2     10     11          12   13   14
3     15     16          17   18   19
4     20     21          22   23   24
5     25     26          27   28   29
6     30     31          32   33   34
7     35     36          37   38   39
8     40     41          42   43   44
9     45     46          47   48   49
10    50     51          52   53   54
11    55     56          57   58   59
12    60     61          62   63   64
13    65     66          67   68   69
14    70     71          72   73   74
15    75     76          77   78   79
16    80     81          82   83   84
17    85     86          87   88   89
18    90     91          92   93   94
19    95     96          97   98   99

In [87]:
frame = pd.DataFrame(np.arange(100).reshape((20, 5)),index=range(0,100,5),columns=['Ohio', 'Texas', 'California','abc','abc'])

In [88]:
frame

    Ohio  Texas  California  abc  abc
0      0      1           2    3    4
5      5      6           7    8    9
10    10     11          12   13   14
15    15     16          17   18   19
20    20     21          22   23   24
25    25     26          27   28   29
30    30     31          32   33   34
35    35     36          37   38   39
40    40     41          42   43   44
45    45     46          47   48   49
50    50     51          52   53   54
55    55     56          57   58   59
60    60     61          62   63   64
65    65     66          67   68   69
70    70     71          72   73   74
75    75     76          77   78   79
80    80     81          82   83   84
85    85     86          87   88   89
90    90     91          92   93   94
95    95     96          97   98   99

In [89]:
stdframe

          math  physics  chemistry  computer  total
nasir       23       13         45        34     81
mansoor     45       88         34        60    167
shakeeb     67       95         55        50    217
shahzaib    89       34         78        70    201
shoaib      56       77         67        80    200

In [93]:
stdframe.loc['yasir']=[45,67,78,99,100]
stdframe

          math  physics  chemistry  computer  total
nasir       23       13         45        34     81
mansoor     45       88         34        60    167
shakeeb     67       95         55        50    217
shahzaib    89       34         78        70    201
shoaib      56       77         67        80    200
yasir       45       67         78        99    100

In [94]:
stdframe.iloc[0:2] # ya exclusive ha single nasir do tu error aye ga

         math  physics  chemistry  computer  total
nasir      23       13         45        34     81
mansoor    45       88         34        60    167

In [95]:
stdframe.loc['nasir':'shakeeb'] # ya inclusive ha

         math  physics  chemistry  computer  total
nasir      23       13         45        34     81
mansoor    45       88         34        60    167
shakeeb    67       95         55        50    217

In [100]:
obj = pd.Series([1,2,3,np.nan,6], index=['a', 'b', 'c', 'd', 'e'])
obj

a    1.0
b    2.0
c    3.0
d    NaN
e    6.0
dtype: float64

In [104]:
new_obj=obj.drop('c')
#pd.isnull(new_obj)
obj=obj.fillna(3)

In [105]:
obj

a    1.0
b    2.0
c    3.0
d    3.0
e    6.0
dtype: float64

In [106]:
obj.drop(['d', 'c'])

a    1.0
b    2.0
e    6.0
dtype: float64

In [107]:
stdframe

          math  physics  chemistry  computer  total
nasir       23       13         45        34     81
mansoor     45       88         34        60    167
shakeeb     67       95         55        50    217
shahzaib    89       34         78        70    201
shoaib      56       77         67        80    200
yasir       45       67         78        99    100

In [112]:
stdframe[["math","chemistry"]]

          math  chemistry
nasir       23         45
mansoor     45         34
shakeeb     67         55
shahzaib    89         78
shoaib      56         67
yasir       45         78

In [113]:
stdframe['physics']>33 #boolean ma answer daga

nasir       False
mansoor      True
shakeeb      True
shahzaib     True
shoaib       True
yasir        True
Name: physics, dtype: bool

In [115]:
stdframe[stdframe['physics']>90]

         math  physics  chemistry  computer  total
shakeeb    67       95         55        50    217

In [120]:
stdframe[(stdframe['physics']>60) & (stdframe['math']>50)]

         math  physics  chemistry  computer  total
shakeeb    67       95         55        50    217
shoaib     56       77         67        80    200

In [15]:
stdframe

          math physics chemistry computer
nasir       23      13      pass     pass
mansoor   pass    pass      pass     pass
shakeeb   pass    pass      pass     pass
shahzaib  pass    pass      pass     pass
shoaib    pass    pass      pass     pass

In [14]:
#stdframe[stdframe < 33]='fail'

stdframe=np.where(stdframe<33,"fail","pass")

TypeError: '<' not supported between instances of 'str' and 'int'

In [12]:
stdframe[stdframe>33]="pass"
stdframe

TypeError: '>' not supported between instances of 'str' and 'int'

In [18]:
stdframe

          math  physics  chemistry  computer
nasir       23       13         45        34
mansoor     45       88         34        60
shakeeb     67       95         55        50
shahzaib    89       34         78        70
shoaib      56       77         67        80

In [21]:
stdframe.loc['nasir',['math','chemistry']]

math         23
chemistry    45
Name: nasir, dtype: int64

In [22]:
stdframe.iloc[1]

math         45
physics      88
chemistry    34
computer     60
Name: mansoor, dtype: int64

In [23]:
stdframe.iloc[1][0]

45

In [24]:
stdframe.iloc[1,[0,3]]

math        45
computer    60
Name: mansoor, dtype: int64

In [26]:
stdframe.iloc[[1,2],[0,3]]

         math  computer
mansoor    45        60
shakeeb    67        50

In [27]:
f=lambda x:x.max()-x.min()
stdframe.apply(f) #anonymous function

math         66
physics      82
chemistry    44
computer     46
dtype: int64

In [29]:
f=lambda x:(x.max(),x.min())
stdframe.apply(f)

math         (89, 23)
physics      (95, 13)
chemistry    (78, 34)
computer     (80, 34)
dtype: object

In [30]:
f=lambda x:[x]
stdframe.apply(f)

math         [[23, 45, 67, 89, 56]]
physics      [[23, 45, 67, 89, 56]]
chemistry    [[23, 45, 67, 89, 56]]
computer     [[23, 45, 67, 89, 56]]
dtype: object

In [31]:
f=lambda x:[x.max(),x.min(),x.sum()]
stdframe.apply(f)

math         [89, 23, 280]
physics      [95, 13, 307]
chemistry    [78, 34, 279]
computer     [80, 34, 294]
dtype: object

In [38]:
f=lambda x:[x.max(),x.min(),x.sum()]
#stdframe.apply(f,axis=1)
stdframe[['math','physics']]

          math  physics
nasir       23       13
mansoor     45       88
shakeeb     67       95
shahzaib    89       34
shoaib      56       77

In [32]:
def minmax(x):
    print( x.min())

minmax(stdframe['math'])

23

In [34]:
def minmax(x):
    print( x.max())

minmax(stdframe['math'])

89

In [33]:
stdframe['math']

nasir       23
mansoor     45
shakeeb     67
shahzaib    89
shoaib      56
Name: math, dtype: int64

In [36]:
l1=list(range(1,1000,34))
max(l1)

987

In [37]:
min(l1)

1

In [41]:
format1=lambda x:print(x)
stdframe.applymap(format1)

23
45
67
89
56
23
45
67
89
56
13
88
95
34
77
45
34
55
78
67
34
60
50
70
80

          math physics chemistry computer
nasir     None    None      None     None
mansoor   None    None      None     None
shakeeb   None    None      None     None
shahzaib  None    None      None     None
shoaib    None    None      None     None

In [42]:
format1=lambda x:print(x)
stdframe['math'].map(format1) #apply map sb pa apply karta ha aur apply single column pa

23
45
67
89
56

nasir       None
mansoor     None
shakeeb     None
shahzaib    None
shoaib      None
Name: math, dtype: object

In [44]:
format1=lambda x:x**2
stdframe[['math','physics']].applymap(format1) #apply map sb pa apply karta ha aur apply single column pa

          math  physics
nasir      529      169
mansoor   2025     7744
shakeeb   4489     9025
shahzaib  7921     1156
shoaib    3136     5929

In [45]:
stdframe

          math  physics  chemistry  computer
nasir       23       13         45        34
mansoor     45       88         34        60
shakeeb     67       95         55        50
shahzaib    89       34         78        70
shoaib      56       77         67        80

In [46]:
np.abs(stdframe)

          math  physics  chemistry  computer
nasir       23       13         45        34
mansoor     45       88         34        60
shakeeb     67       95         55        50
shahzaib    89       34         78        70
shoaib      56       77         67        80

In [47]:
f = lambda x: x.max() - x.min()
stdframe.apply(f) # axis nhi diya ha tu bydefault row sa dakha ga

math         66
physics      82
chemistry    44
computer     46
dtype: int64

In [48]:
stdframe.apply(f, axis='columns') #Column ka mean max nikala ga

nasir       32
mansoor     54
shakeeb     45
shahzaib    55
shoaib      24
dtype: int64

In [49]:
stdframe

          math  physics  chemistry  computer
nasir       23       13         45        34
mansoor     45       88         34        60
shakeeb     67       95         55        50
shahzaib    89       34         78        70
shoaib      56       77         67        80

In [50]:
def f(x):
     return pd.Series([x.min(), x.max()], index=['min', 'max'])

In [51]:
stdframe.apply(f)

     math  physics  chemistry  computer
min    23       13         34        34
max    89       95         78        80

In [52]:
f1=lambda x,y :x+y
f1(2,4)

6

In [53]:
f2=lambda x: np.square(x)
stdframe['math'].map(f2) #map, apply means same ha

nasir        529
mansoor     2025
shakeeb     4489
shahzaib    7921
shoaib      3136
Name: math, dtype: int64

In [54]:
stdframe.applymap(f2)

          math  physics  chemistry  computer
nasir      529      169       2025      1156
mansoor   2025     7744       1156      3600
shakeeb   4489     9025       3025      2500
shahzaib  7921     1156       6084      4900
shoaib    3136     5929       4489      6400

In [55]:
stdframe['math'].apply(f2)

nasir        529
mansoor     2025
shakeeb     4489
shahzaib    7921
shoaib      3136
Name: math, dtype: int64

In [56]:
stdframe.apply(f2)

          math  physics  chemistry  computer
nasir      529      169       2025      1156
mansoor   2025     7744       1156      3600
shakeeb   4489     9025       3025      2500
shahzaib  7921     1156       6084      4900
shoaib    3136     5929       4489      6400

In [ ]:
f3=lambda x:x.min()

In [ ]:
#apply series ka liya kam ata ha
#map column pa kam kartaa ha
#applyframe har columnn ka andar map chalata ha

In [60]:
f3=lambda x:"pass" if x>33 else "fail"
stdframe['math'].map(f3)

nasir       fail
mansoor     pass
shakeeb     pass
shahzaib    pass
shoaib      pass
Name: math, dtype: object

In [58]:
stdframe.applymap(f3)

          math physics chemistry computer
nasir     fail    fail      pass     pass
mansoor   pass    pass      pass     pass
shakeeb   pass    pass      pass     pass
shahzaib  pass    pass      pass     pass
shoaib    pass    pass      pass     pass

In [61]:
f4=lambda x: x.sum()
stdframe.apply(f4)

math         280
physics      307
chemistry    279
computer     294
dtype: int64

In [63]:
stdframe.sort_index()

          math  physics  chemistry  computer
mansoor     45       88         34        60
nasir       23       13         45        34
shahzaib    89       34         78        70
shakeeb     67       95         55        50
shoaib      56       77         67        80

In [66]:
stdframe.sort_index(ascending=False)

          math  physics  chemistry  computer
shoaib      56       77         67        80
shakeeb     67       95         55        50
shahzaib    89       34         78        70
nasir       23       13         45        34
mansoor     45       88         34        60

In [62]:
stdframe.sort_values(by="math")

          math  physics  chemistry  computer
nasir       23       13         45        34
mansoor     45       88         34        60
shoaib      56       77         67        80
shakeeb     67       95         55        50
shahzaib    89       34         78        70

In [67]:
stdframe.sort_values(by="math",inplace=True) #inplace memory ma copy banaye ga

In [68]:
stdframe

          math  physics  chemistry  computer
nasir       23       13         45        34
mansoor     45       88         34        60
shoaib      56       77         67        80
shakeeb     67       95         55        50
shahzaib    89       34         78        70

In [69]:
stdframe

          math  physics  chemistry  computer
nasir       23       13         45        34
mansoor     45       88         34        60
shoaib      56       77         67        80
shakeeb     67       95         55        50
shahzaib    89       34         78        70